Autodesk.Revit.DB.DocumentVersion.IsEqual(Autodesk.Revit.DB.DocumentVersion)
Checks whether two DocumentVersions are identical.
They are identical if both the GUID and number of saves
are equal. If two DocumentVersions are identical, they
come from the same document, with the same set of changes.
other:
The DocumentVersion to compare to this DocumentVersion.
Returns:
True if the two DocumentVersions are equal. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DocumentVersion.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DocumentVersion.NumberOfSaves
The number of times the document has been saved. The save number and GUID
are both necessary to uniquely identify a document version.
Since:
2015

Autodesk.Revit.DB.DocumentVersion.VersionGUID
The GUID portion of the DocumentVersion. The GUID is updated when changes
are made to the document, but may not update with every change to the document.
The GUID and save number are both necessary to uniquely identify a document version.
Since:
2015

Autodesk.Revit.DB.DocumentVersion
This class uniquely identifies an edition of a given document.
Remarks:
DocumentVersion consists
of two parts - a GUID and an integer. The GUID is updated as new elements
are created in the document, but it is not necessarily changed whenever
any individual change is made to the document. The integer is updated when
the document is saved.
The GUID will change as changes are made to a model, so it should not be treated
as a static value.
This class does not contain any time information - you cannot compare two
DocumentVersions and know which document is newer. It can be used
to tell whether a document has changed since it was last inspected.
See Autodesk.Revit.DB.BasicFileInfo.GetDocumentVersion
Since:
2015